[
  {
    "id": "7",
    "name": "Into the Twilight! - Fixes and Improvements 2",
    "description": "Bug fixes and improvements.",
    "version": "0.1.5.1b",
    "date": "2025-09-25",
    "changes": [
      "Cries added to fakemons.",
      "Missing spanish translations",
      "Display_height and display_width methods force to Graphics Module (A fix try for some Joiplay players)."
    ]
  },
  {
    "id": "6",
    "name": "Into the Twilight! - Fixes and Improvements",
    "description": "Bug fixes, improvements, and content updates including Pokédex entries, encounter adjustments, and visual fixes.",
    "version": "0.1.5.1a",
    "date": "2025-09-19",
    "changes": [
      "Golurk overworld size fixed.",
      "Some Fakemon position in battle fixed.",
      "Some missing Pokédex entry descriptions added.",
      "Collision fix.",
      "Tiny medal validation on heal in Pokémon Centers.",
      "Encounters updated in Nightfall Forest.",
      "\"Dusk\" is now \"Nightfall Forest\".",
      "Encounter list in \"Nightfall Forest\" updated.",
      "New images added to the scene after Gym Leader battle."
    ]
  },
  {
    "id": "5",
    "name": "Into the Twilight!",
    "description": "New mission, items, Fakemon, battle visuals, systems, a major crafting rework and bug fixes and a big secondary mission, \"The Twilight Sword!\".",
    "version": "0.1.5",
    "date": "2025-09-18",
    "changes": [
      "Silky Cocoon now grants a Silk Shield on entry, making the user immune to powder moves.",
      "TM104 now teaches Silky Cocoon (given by Gym Leader Rumex).",
      "Protoshield visual bug fixed.",
      "Removed two Gym Leader faces from the trainer card back to avoid confusion.",
      "Boutique inventory updated.",
      "New mission: \"Twilight Sword\".",
      "Zelda and Link outfits now obtainable in \"Twilight Sword\".",
      "Simulated Universe rewards now grant correctly.",
      "New Simulated Universe level: \"Random Types for All\".",
      "Pokédex order adjusted.",
      "Field effects (e.g., Trick Room) now visible in battle.",
      "Weather effects (e.g., Sunny Day) now visible in battle.",
      "Side field effects (e.g., Spikes) now visible in battle.",
      "Battle timer implemented and visible.",
      "Party order changes now update the Pokémon preview image.",
      "New item: Twilight Crown: applies Trick Room for 3 turns on switch-in.",
      "New item: Master Sword: slightly boosts cutting moves; effect doubled for Growrage or Twylican.",
      "Two new maps added.",
      "New Fakemon: Axish.",
      "New Fakemon: Jaxews (evolves from Axish).",
      "New Fakemon: Flover (My child).",
      "New Fakemon: Wywerden (evolves from Flover).",
      "New Fakemon: Twylican (evolves from Growrage).",
      "New form: Twylican Hero when holding Master Sword.",
      "New Fakemon: Twixie.",
      "New Fakemon: Twincess (evolves from Twixie).",
      "New Fakemon: Ashcoil.",
      "New Fakemon: Blazecoil (evolves from Ashcoil).",
      "New Fakemon: Infernoil (evolves from Blazecoil).",
      "Crafting system reworked.",
      "CombatDataBox now shows No Retreat.",
      "CombatDataBox now shows Perish Song.",
      "CombatDataBox now shows Fury Cutter stacking.",
      "Toxic status visuals fixed.",
      "DBK plugins updated.",
      "Overworld character pattern change fixed.",
      "Gained EXP no longer uses floating-point values.",
      "New outfit: Shantae.",
      "New outfit: Mega Man.",
      "New outfit: Saber (Fate).",
      "Damage text now displays when dealing damage in battle (can be disabled on options).",
      "New scene images added.",
      "Ability \"Jungle Protector\" now generates 1/8 Protoshield instead of 1/16.",
      "New item: Dark Scythe: if an opponent’s HP is 10% or less after the holder uses a move, the holder instantly KOs that opponent.",
      "Added JoiPlay compatibility toggle in Options; disables unsupported components.",
      "Fixed HP when catching a Raid Pokémon.",
      "New Battle Animation System.",
      "New Fishing Pokémon System.",
      "Tutorial added: Fishing.",
      "Tutorial added: Crafting.",
      "Mystery Gift now obtainable from Pokémon Center PCs.",
      "Various Pokédex errors fixed.",
      "Pokédex can now show habitat in the background (can be disabled on options).",
      "Pokémon obedience bug fixed.",
      "Overworld player walking and running animations fixed.",
      "New item: Obedience Candy: makes a Pokémon fully obedient regardless of level.",
      "New item: Rebellion Candy: makes a Pokémon rebellious and likely to ignore commands in battle.",
      "A lot of new cards on the simulated universe (+200)."
    ]
  },
  {
    "id": "4",
    "name": "Encounter List UI update",
    "description": "This update improves the Encounter List interface, fixes related bugs, and includes minor enhancements across the game.",
    "version": "v0.1.4",
    "date": "2025-07-18",
    "changes": [
      "Fixed a visual glitch affecting the Encounter List watcher.",
      "Corrected various spelling mistakes.",
      "Added a small tutorial explaining the Selective Pheromone item.",
      "Replaced the old Kingdom Hearts music with a new track (copyright problem).",
      "EXP scaling has been adjusted to properly respect the level cap."
    ]
  },
  {
    "id": "3",
    "name": "I don't know, some changes",
    "description": "This update brings key bug fixes, gameplay adjustments, and quality-of-life improvements. Major highlights include evolution fixes for Yuntter and Weamoth, proper tracking for the Floatzel mission, and the ability to earn EXP and money in Simulated Universe battles. Several trainers and their teams have been adjusted, item and encounter rates have been rebalanced, and various text, music, and UI improvements have been made — including a small surprise at the end of the beta.",
    "version": "v0.1.3",
    "date": "2025-07-18",
    "changes": [
      "Fixed skip scene error in the farm.",
      "Fixed skip scene error in the forest.",
      "Floatzel mission is now correctly recorded on the cellphone.",
      "Yuntter can now evolve by level and Water Stone, not just by Twilight Stone.",
      "Weamoth can now evolve via trade.",
      "Some trainer teams have been changed.",
      "Unnecessary trainers have been removed.",
      "Some Pokémon have been removed from trainer teams.",
      "Trainer Pokémon levels adjusted.",
      "Minor text edits.",
      "You now gain EXP and money in Simulated Universe battles.",
      "Simulated Universe items are now received after winning — player storage is no longer required.",
      "Some music tracks have been changed.",
      "Reduced the amount of Yuntter Rocks on Route 4 (sorry, too many Yuntters).",
      "Some item locations have been changed.",
      "Encounter chance per step reduced.",
      "The team sort option in the pause menu now only appears if you have more than one Pokémon in your party.",
      "Fixed some missing Spanish translations.",
      "A tiny message now appears at the end of the beta.",
      "Some Pokémon tutor moves have been changed.",
      "Gumstter cry added.",
      "Orthographic errors in Ditto's calls fixed — because apparently no one got the joke :/",
      "Cellphone UI updated for calls.",
      "Some shadows on tiles added,",
      "Small improvement to Kaoba lab event when changing maps.",
      "Outfit prices reduced.",
      "Some PLACEHOLDER items added in dungeons (dungeons are a feature I'll be expanding in the next beta).",
      "Encounter Finder updated.",
      "Lillipud mission changed — it can no longer call for help.",
      "Fixed corrupted animation."
    ]
  },
  {
    "id": "2",
    "name": "Misspelling",
    "description": "",
    "version": "v0.1.2",
    "date": "2025-07-15",
    "changes": [
      "Fixed various spelling errors in dialogues and menus.",
      "Fixed a transition bug when starting a battle against a rival trainer."
    ]
  },
  {
    "id": "1",
    "name": "Multiplayer error fix",
    "description": "",
    "version": "v0.1.1",
    "date": "2025-07-14",
    "changes": [
      "Fixed an issue in multiplayer when both players had the same gender.",
      "Improved several Pokédex descriptions."
    ]
  }
]
